7767517
1405 1778
SherpaMetaData           sherpa_meta_data1        0 0 -23330=0 0=1 1=16 2=32 3=31 4=8 5=32 6=8 7=144
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Split                    splitncnn_0              1 2 in1 2 3
Input                    in2                      0 1 in2
Input                    in3                      0 1 in3
Input                    in4                      0 1 in4
Input                    in5                      0 1 in5
Split                    splitncnn_1              1 2 in5 8 9
Input                    in6                      0 1 in6
Input                    in7                      0 1 in7
Input                    in8                      0 1 in8
Input                    in9                      0 1 in9
Split                    splitncnn_2              1 2 in9 14 15
Input                    in10                     0 1 in10
Input                    in11                     0 1 in11
Input                    in12                     0 1 in12
Input                    in13                     0 1 in13
Split                    splitncnn_3              1 2 in13 20 21
Input                    in14                     0 1 in14
Input                    in15                     0 1 in15
Input                    in16                     0 1 in16
Input                    in17                     0 1 in17
Split                    splitncnn_4              1 2 in17 26 27
Input                    in18                     0 1 in18
Input                    in19                     0 1 in19
Input                    in20                     0 1 in20
Input                    in21                     0 1 in21
Split                    splitncnn_5              1 2 in21 32 33
Input                    in22                     0 1 in22
Input                    in23                     0 1 in23
Input                    in24                     0 1 in24
Input                    in25                     0 1 in25
Split                    splitncnn_6              1 2 in25 38 39
Input                    in26                     0 1 in26
Input                    in27                     0 1 in27
Input                    in28                     0 1 in28
Input                    in29                     0 1 in29
Split                    splitncnn_7              1 2 in29 44 45
Input                    in30                     0 1 in30
Input                    in31                     0 1 in31
Input                    in32                     0 1 in32
Input                    in33                     0 1 in33
Split                    splitncnn_8              1 2 in33 50 51
Input                    in34                     0 1 in34
Input                    in35                     0 1 in35
Input                    in36                     0 1 in36
Input                    in37                     0 1 in37
Split                    splitncnn_9              1 2 in37 56 57
Input                    in38                     0 1 in38
Input                    in39                     0 1 in39
Input                    in40                     0 1 in40
Input                    in41                     0 1 in41
Split                    splitncnn_10             1 2 in41 62 63
Input                    in42                     0 1 in42
Input                    in43                     0 1 in43
Input                    in44                     0 1 in44
Input                    in45                     0 1 in45
Split                    splitncnn_11             1 2 in45 68 69
Input                    in46                     0 1 in46
Input                    in47                     0 1 in47
Input                    in48                     0 1 in48
Input                    in49                     0 1 in49
Split                    splitncnn_12             1 2 in49 74 75
Input                    in50                     0 1 in50
Input                    in51                     0 1 in51
Input                    in52                     0 1 in52
Input                    in53                     0 1 in53
Split                    splitncnn_13             1 2 in53 80 81
Input                    in54                     0 1 in54
Input                    in55                     0 1 in55
Input                    in56                     0 1 in56
Input                    in57                     0 1 in57
Split                    splitncnn_14             1 2 in57 86 87
Input                    in58                     0 1 in58
Input                    in59                     0 1 in59
Input                    in60                     0 1 in60
Input                    in61                     0 1 in61
Split                    splitncnn_15             1 2 in61 92 93
Input                    in62                     0 1 in62
Input                    in63                     0 1 in63
Input                    in64                     0 1 in64
ExpandDims               unsqueeze_590            1 1 in0 97 -23303=1,0
Convolution              conv_115                 1 1 97 98 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72
Split                    splitncnn_16             1 2 98 99 100
BinaryOp                 sub_0                    1 1 99 101 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_16               1 1 101 102
BinaryOp                 mul_1                    2 1 100 102 103 0=2
Convolution              conv_116                 1 1 103 104 0=32 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=2304
Split                    splitncnn_17             1 2 104 105 106
BinaryOp                 sub_2                    1 1 105 107 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_17               1 1 107 108
BinaryOp                 mul_3                    2 1 106 108 109 0=2
Convolution              conv_117                 1 1 109 110 0=128 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=36864
Split                    splitncnn_18             1 2 110 111 112
BinaryOp                 sub_4                    1 1 111 113 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_18               1 1 113 114
BinaryOp                 mul_5                    2 1 112 114 115 0=2
Permute                  permute_459              1 1 115 116 0=2
Reshape                  reshape_231              1 1 116 117 0=2432 1=-1
InnerProduct             linear_118               1 1 117 118 0=144 1=1 2=350208
Split                    splitncnn_19             1 3 118 119 120 121
BinaryOp                 mul_6                    2 1 119 120 122 0=2
Reduction                mean_426                 1 1 122 123 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_7                    1 1 123 124 0=0 1=1 2=2.500004e-01
BinaryOp                 pow_8                    1 1 124 125 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_9                    2 1 121 125 126 0=2
Crop                     slice_248                1 1 126 127 -23310=1,-1 -23311=1,0 -23309=1,1
Slice                    tensor_split_0           1 2 127 128 129 -23300=2,8,-233 1=0
Concat                   cat_0                    2 1 129 128 130 0=0
Split                    splitncnn_20             1 2 130 131 132
InnerProduct             linear_119               1 1 132 133 0=576 1=1 2=82944
Split                    splitncnn_21             1 2 133 134 135
BinaryOp                 sub_10                   1 1 134 136 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_19               1 1 136 137
BinaryOp                 mul_11                   2 1 135 137 138 0=2
InnerProduct             linear_120               1 1 138 139 0=144 1=1 2=82944
BinaryOp                 add_12                   2 1 131 139 140 0=0
Split                    splitncnn_22             1 2 140 141 142
Slice                    tensor_split_1           1 2 141 143 144 -23300=2,2,-233 1=0
Split                    splitncnn_24             1 3 144 145 146 147
Split                    splitncnn_23             1 2 143 148 149
Concat                   cat_1                    2 1 148 145 150 0=0
Concat                   cat_2                    3 1 2 149 146 151 0=0
InnerProduct             linear_122               1 1 151 152 0=288 1=1 2=41472
Slice                    chunk_0                  1 2 152 153 154 -23300=2,-233,-233 1=1
InnerProduct             linear_121               1 1 150 155 0=144 1=1 2=20736
Slice                    tensor_split_2           1 2 153 156 157 -23300=2,34,-233 1=0
Concat                   cat_3                    3 1 156 in2 157 158 0=0
Split                    splitncnn_25             1 2 158 159 160
Slice                    tensor_split_3           1 2 154 161 162 -23300=2,34,-233 1=0
Concat                   cat_4                    3 1 161 in3 162 163 0=0
Split                    splitncnn_26             1 2 163 164 165
Reshape                  view_346                 1 1 155 166 0=36 1=4 2=10
Permute                  permute_461              1 1 166 167 0=2
BinaryOp                 mul_13                   1 1 167 168 0=2 1=1 2=1.666667e-01
Reshape                  view_347                 1 1 160 169 0=36 1=4 2=50
Reshape                  view_348                 1 1 165 170 0=36 1=4 2=50
Permute                  permute_462              1 1 169 171 0=2
MatMul                   matmultransb_0           2 1 168 171 172 0=1
Softmax                  softmax_67               1 1 172 173 0=-1 1=1
Permute                  permute_464              1 1 170 174 0=2
MatMul                   bmm_395                  2 1 173 174 175
Permute                  permute_465              1 1 175 176 0=2
Reshape                  reshape_232              1 1 176 177 0=144 1=-1
ExpandDims               unsqueeze_591            1 1 177 178
InnerProduct             linear_123               1 1 178 179 0=144 1=1 2=20736
BinaryOp                 add_14                   2 1 142 179 180 0=0
Split                    splitncnn_27             1 2 180 181 182
Slice                    tensor_split_4           1 2 181 183 184 -23300=2,2,-233 1=0
Concat                   cat_5                    2 1 184 183 185 0=0
Permute                  permute_466              1 1 185 186 0=1
Convolution1D            conv1d_83                1 1 186 187 0=288 1=1 2=1 3=1 4=0 5=1 6=41472
GLU                      glu_0                    1 1 187 188 0=0
Concat                   cat_6                    2 1 in4 188 189 0=1
Split                    splitncnn_28             1 2 189 190 191
ConvolutionDepthWise1D   convdw1d_607             1 1 191 192 0=144 1=31 2=1 3=1 4=0 5=1 6=4464 7=144
Split                    splitncnn_29             1 2 192 193 194
BinaryOp                 sub_15                   1 1 193 195 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_20               1 1 195 196
BinaryOp                 mul_16                   2 1 194 196 197 0=2
Convolution1D            conv1d_84                1 1 197 198 0=144 1=1 2=1 3=1 4=0 5=1 6=20736
Slice                    tensor_split_5           1 2 198 199 200 -23300=2,8,-233 1=1
Permute                  permute_468              1 1 199 201 0=1
Permute                  permute_467              1 1 200 202 0=1
Concat                   cat_7                    2 1 202 201 203 0=0
BinaryOp                 add_17                   2 1 182 203 204 0=0
Split                    splitncnn_30             1 2 204 205 206
InnerProduct             linear_124               1 1 206 207 0=576 1=1 2=82944
Split                    splitncnn_31             1 2 207 208 209
BinaryOp                 sub_18                   1 1 208 210 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_21               1 1 210 211
BinaryOp                 mul_19                   2 1 209 211 212 0=2
InnerProduct             linear_125               1 1 212 213 0=144 1=1 2=82944
BinaryOp                 add_20                   2 1 205 213 214 0=0
Split                    splitncnn_32             1 3 214 215 216 217
BinaryOp                 mul_21                   2 1 215 216 218 0=2
Reduction                mean_428                 1 1 218 219 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_22                   1 1 219 220 0=0 1=1 2=9.635315e-01
BinaryOp                 pow_23                   1 1 220 221 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_24                   2 1 217 221 222 0=2
Slice                    tensor_split_6           1 2 222 223 224 -23300=2,2,-233 1=0
Concat                   cat_8                    2 1 223 224 225 0=0
Split                    splitncnn_33             1 2 225 226 227
InnerProduct             linear_126               1 1 227 228 0=576 1=1 2=82944
Split                    splitncnn_34             1 2 228 229 230
BinaryOp                 sub_25                   1 1 229 231 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_22               1 1 231 232
BinaryOp                 mul_26                   2 1 230 232 233 0=2
InnerProduct             linear_127               1 1 233 234 0=144 1=1 2=82944
BinaryOp                 add_27                   2 1 226 234 235 0=0
Split                    splitncnn_35             1 2 235 236 237
Slice                    tensor_split_7           1 2 236 238 239 -23300=2,2,-233 1=0
Split                    splitncnn_37             1 3 239 240 241 242
Split                    splitncnn_36             1 2 238 243 244
Concat                   cat_9                    2 1 243 240 245 0=0
Concat                   cat_10                   3 1 8 244 241 246 0=0
InnerProduct             linear_129               1 1 246 247 0=288 1=1 2=41472
Slice                    chunk_1                  1 2 247 248 249 -23300=2,-233,-233 1=1
InnerProduct             linear_128               1 1 245 250 0=144 1=1 2=20736
Slice                    tensor_split_8           1 2 248 251 252 -23300=2,34,-233 1=0
Concat                   cat_11                   3 1 251 in6 252 253 0=0
Split                    splitncnn_38             1 2 253 254 255
Slice                    tensor_split_9           1 2 249 256 257 -23300=2,34,-233 1=0
Concat                   cat_12                   3 1 256 in7 257 258 0=0
Split                    splitncnn_39             1 2 258 259 260
Reshape                  view_349                 1 1 250 261 0=36 1=4 2=10
Permute                  permute_469              1 1 261 262 0=2
BinaryOp                 mul_28                   1 1 262 263 0=2 1=1 2=1.666667e-01
Reshape                  view_350                 1 1 255 264 0=36 1=4 2=50
Reshape                  view_351                 1 1 260 265 0=36 1=4 2=50
Permute                  permute_470              1 1 264 266 0=2
MatMul                   matmultransb_1           2 1 263 266 267 0=1
Softmax                  softmax_68               1 1 267 268 0=-1 1=1
Permute                  permute_472              1 1 265 269 0=2
MatMul                   bmm_397                  2 1 268 269 270
Permute                  permute_473              1 1 270 271 0=2
Reshape                  reshape_233              1 1 271 272 0=144 1=-1
ExpandDims               unsqueeze_592            1 1 272 273
InnerProduct             linear_130               1 1 273 274 0=144 1=1 2=20736
BinaryOp                 add_29                   2 1 237 274 275 0=0
Split                    splitncnn_40             1 2 275 276 277
Slice                    tensor_split_10          1 2 276 278 279 -23300=2,2,-233 1=0
Concat                   cat_13                   2 1 279 278 280 0=0
Permute                  permute_474              1 1 280 281 0=1
Convolution1D            conv1d_85                1 1 281 282 0=288 1=1 2=1 3=1 4=0 5=1 6=41472
GLU                      glu_1                    1 1 282 283 0=0
Concat                   cat_14                   2 1 in8 283 284 0=1
Split                    splitncnn_41             1 2 284 285 286
ConvolutionDepthWise1D   convdw1d_608             1 1 286 287 0=144 1=31 2=1 3=1 4=0 5=1 6=4464 7=144
Split                    splitncnn_42             1 2 287 288 289
BinaryOp                 sub_30                   1 1 288 290 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_23               1 1 290 291
BinaryOp                 mul_31                   2 1 289 291 292 0=2
Convolution1D            conv1d_86                1 1 292 293 0=144 1=1 2=1 3=1 4=0 5=1 6=20736
Slice                    tensor_split_11          1 2 293 294 295 -23300=2,8,-233 1=1
Permute                  permute_476              1 1 294 296 0=1
Permute                  permute_475              1 1 295 297 0=1
Concat                   cat_15                   2 1 297 296 298 0=0
BinaryOp                 add_32                   2 1 277 298 299 0=0
Split                    splitncnn_43             1 2 299 300 301
InnerProduct             linear_131               1 1 301 302 0=576 1=1 2=82944
Split                    splitncnn_44             1 2 302 303 304
BinaryOp                 sub_33                   1 1 303 305 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_24               1 1 305 306
BinaryOp                 mul_34                   2 1 304 306 307 0=2
InnerProduct             linear_132               1 1 307 308 0=144 1=1 2=82944
BinaryOp                 add_35                   2 1 300 308 309 0=0
Split                    splitncnn_45             1 3 309 310 311 312
BinaryOp                 mul_36                   2 1 310 311 313 0=2
Reduction                mean_430                 1 1 313 314 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_37                   1 1 314 315 0=0 1=1 2=1.013315e+00
BinaryOp                 pow_38                   1 1 315 316 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_39                   2 1 312 316 317 0=2
Slice                    tensor_split_12          1 2 317 318 319 -23300=2,2,-233 1=0
Concat                   cat_16                   2 1 318 319 320 0=0
Split                    splitncnn_46             1 2 320 321 322
InnerProduct             linear_133               1 1 322 323 0=576 1=1 2=82944
Split                    splitncnn_47             1 2 323 324 325
BinaryOp                 sub_40                   1 1 324 326 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_25               1 1 326 327
BinaryOp                 mul_41                   2 1 325 327 328 0=2
InnerProduct             linear_134               1 1 328 329 0=144 1=1 2=82944
BinaryOp                 add_42                   2 1 321 329 330 0=0
Split                    splitncnn_48             1 2 330 331 332
Slice                    tensor_split_13          1 2 331 333 334 -23300=2,2,-233 1=0
Split                    splitncnn_50             1 3 334 335 336 337
Split                    splitncnn_49             1 2 333 338 339
Concat                   cat_17                   2 1 338 335 340 0=0
Concat                   cat_18                   3 1 14 339 336 341 0=0
InnerProduct             linear_136               1 1 341 342 0=288 1=1 2=41472
Slice                    chunk_2                  1 2 342 343 344 -23300=2,-233,-233 1=1
InnerProduct             linear_135               1 1 340 345 0=144 1=1 2=20736
Slice                    tensor_split_14          1 2 343 346 347 -23300=2,34,-233 1=0
Concat                   cat_19                   3 1 346 in10 347 348 0=0
Split                    splitncnn_51             1 2 348 349 350
Slice                    tensor_split_15          1 2 344 351 352 -23300=2,34,-233 1=0
Concat                   cat_20                   3 1 351 in11 352 353 0=0
Split                    splitncnn_52             1 2 353 354 355
Reshape                  view_352                 1 1 345 356 0=36 1=4 2=10
Permute                  permute_477              1 1 356 357 0=2
BinaryOp                 mul_43                   1 1 357 358 0=2 1=1 2=1.666667e-01
Reshape                  view_353                 1 1 350 359 0=36 1=4 2=50
Reshape                  view_354                 1 1 355 360 0=36 1=4 2=50
Permute                  permute_478              1 1 359 361 0=2
MatMul                   matmultransb_2           2 1 358 361 362 0=1
Softmax                  softmax_69               1 1 362 363 0=-1 1=1
Permute                  permute_480              1 1 360 364 0=2
MatMul                   bmm_399                  2 1 363 364 365
Permute                  permute_481              1 1 365 366 0=2
Reshape                  reshape_234              1 1 366 367 0=144 1=-1
ExpandDims               unsqueeze_593            1 1 367 368
InnerProduct             linear_137               1 1 368 369 0=144 1=1 2=20736
BinaryOp                 add_44                   2 1 332 369 370 0=0
Split                    splitncnn_53             1 2 370 371 372
Slice                    tensor_split_16          1 2 371 373 374 -23300=2,2,-233 1=0
Concat                   cat_21                   2 1 374 373 375 0=0
Permute                  permute_482              1 1 375 376 0=1
Convolution1D            conv1d_87                1 1 376 377 0=288 1=1 2=1 3=1 4=0 5=1 6=41472
GLU                      glu_2                    1 1 377 378 0=0
Concat                   cat_22                   2 1 in12 378 379 0=1
Split                    splitncnn_54             1 2 379 380 381
ConvolutionDepthWise1D   convdw1d_609             1 1 381 382 0=144 1=31 2=1 3=1 4=0 5=1 6=4464 7=144
Split                    splitncnn_55             1 2 382 383 384
BinaryOp                 sub_45                   1 1 383 385 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_26               1 1 385 386
BinaryOp                 mul_46                   2 1 384 386 387 0=2
Convolution1D            conv1d_88                1 1 387 388 0=144 1=1 2=1 3=1 4=0 5=1 6=20736
Slice                    tensor_split_17          1 2 388 389 390 -23300=2,8,-233 1=1
Permute                  permute_484              1 1 389 391 0=1
Permute                  permute_483              1 1 390 392 0=1
Concat                   cat_23                   2 1 392 391 393 0=0
BinaryOp                 add_47                   2 1 372 393 394 0=0
Split                    splitncnn_56             1 2 394 395 396
InnerProduct             linear_138               1 1 396 397 0=576 1=1 2=82944
Split                    splitncnn_57             1 2 397 398 399
BinaryOp                 sub_48                   1 1 398 400 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_27               1 1 400 401
BinaryOp                 mul_49                   2 1 399 401 402 0=2
InnerProduct             linear_139               1 1 402 403 0=144 1=1 2=82944
BinaryOp                 add_50                   2 1 395 403 404 0=0
Split                    splitncnn_58             1 3 404 405 406 407
BinaryOp                 mul_51                   2 1 405 406 408 0=2
Reduction                mean_432                 1 1 408 409 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_52                   1 1 409 410 0=0 1=1 2=1.069920e+00
BinaryOp                 pow_53                   1 1 410 411 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_54                   2 1 407 411 412 0=2
Slice                    tensor_split_18          1 2 412 413 414 -23300=2,2,-233 1=0
Concat                   cat_24                   2 1 413 414 415 0=0
Split                    splitncnn_59             1 2 415 416 417
InnerProduct             linear_140               1 1 417 418 0=576 1=1 2=82944
Split                    splitncnn_60             1 2 418 419 420
BinaryOp                 sub_55                   1 1 419 421 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_28               1 1 421 422
BinaryOp                 mul_56                   2 1 420 422 423 0=2
InnerProduct             linear_141               1 1 423 424 0=144 1=1 2=82944
BinaryOp                 add_57                   2 1 416 424 425 0=0
Split                    splitncnn_61             1 2 425 426 427
Slice                    tensor_split_19          1 2 426 428 429 -23300=2,2,-233 1=0
Split                    splitncnn_63             1 3 429 430 431 432
Split                    splitncnn_62             1 2 428 433 434
Concat                   cat_25                   2 1 433 430 435 0=0
Concat                   cat_26                   3 1 20 434 431 436 0=0
InnerProduct             linear_143               1 1 436 437 0=288 1=1 2=41472
Slice                    chunk_3                  1 2 437 438 439 -23300=2,-233,-233 1=1
InnerProduct             linear_142               1 1 435 440 0=144 1=1 2=20736
Slice                    tensor_split_20          1 2 438 441 442 -23300=2,34,-233 1=0
Concat                   cat_27                   3 1 441 in14 442 443 0=0
Split                    splitncnn_64             1 2 443 444 445
Slice                    tensor_split_21          1 2 439 446 447 -23300=2,34,-233 1=0
Concat                   cat_28                   3 1 446 in15 447 448 0=0
Split                    splitncnn_65             1 2 448 449 450
Reshape                  view_355                 1 1 440 451 0=36 1=4 2=10
Permute                  permute_485              1 1 451 452 0=2
BinaryOp                 mul_58                   1 1 452 453 0=2 1=1 2=1.666667e-01
Reshape                  view_356                 1 1 445 454 0=36 1=4 2=50
Reshape                  view_357                 1 1 450 455 0=36 1=4 2=50
Permute                  permute_486              1 1 454 456 0=2
MatMul                   matmultransb_3           2 1 453 456 457 0=1
Softmax                  softmax_70               1 1 457 458 0=-1 1=1
Permute                  permute_488              1 1 455 459 0=2
MatMul                   bmm_401                  2 1 458 459 460
Permute                  permute_489              1 1 460 461 0=2
Reshape                  reshape_235              1 1 461 462 0=144 1=-1
ExpandDims               unsqueeze_594            1 1 462 463
InnerProduct             linear_144               1 1 463 464 0=144 1=1 2=20736
BinaryOp                 add_59                   2 1 427 464 465 0=0
Split                    splitncnn_66             1 2 465 466 467
Slice                    tensor_split_22          1 2 466 468 469 -23300=2,2,-233 1=0
Concat                   cat_29                   2 1 469 468 470 0=0
Permute                  permute_490              1 1 470 471 0=1
Convolution1D            conv1d_89                1 1 471 472 0=288 1=1 2=1 3=1 4=0 5=1 6=41472
GLU                      glu_3                    1 1 472 473 0=0
Concat                   cat_30                   2 1 in16 473 474 0=1
Split                    splitncnn_67             1 2 474 475 476
ConvolutionDepthWise1D   convdw1d_610             1 1 476 477 0=144 1=31 2=1 3=1 4=0 5=1 6=4464 7=144
Split                    splitncnn_68             1 2 477 478 479
BinaryOp                 sub_60                   1 1 478 480 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_29               1 1 480 481
BinaryOp                 mul_61                   2 1 479 481 482 0=2
Convolution1D            conv1d_90                1 1 482 483 0=144 1=1 2=1 3=1 4=0 5=1 6=20736
Slice                    tensor_split_23          1 2 483 484 485 -23300=2,8,-233 1=1
Permute                  permute_492              1 1 484 486 0=1
Permute                  permute_491              1 1 485 487 0=1
Concat                   cat_31                   2 1 487 486 488 0=0
BinaryOp                 add_62                   2 1 467 488 489 0=0
Split                    splitncnn_69             1 2 489 490 491
InnerProduct             linear_145               1 1 491 492 0=576 1=1 2=82944
Split                    splitncnn_70             1 2 492 493 494
BinaryOp                 sub_63                   1 1 493 495 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_30               1 1 495 496
BinaryOp                 mul_64                   2 1 494 496 497 0=2
InnerProduct             linear_146               1 1 497 498 0=144 1=1 2=82944
BinaryOp                 add_65                   2 1 490 498 499 0=0
Split                    splitncnn_71             1 3 499 500 501 502
BinaryOp                 mul_66                   2 1 500 501 503 0=2
Reduction                mean_434                 1 1 503 504 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_67                   1 1 504 505 0=0 1=1 2=1.152986e+00
BinaryOp                 pow_68                   1 1 505 506 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_69                   2 1 502 506 507 0=2
Slice                    tensor_split_24          1 2 507 508 509 -23300=2,2,-233 1=0
Concat                   cat_32                   2 1 508 509 510 0=0
Split                    splitncnn_72             1 2 510 511 512
InnerProduct             linear_147               1 1 512 513 0=576 1=1 2=82944
Split                    splitncnn_73             1 2 513 514 515
BinaryOp                 sub_70                   1 1 514 516 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_31               1 1 516 517
BinaryOp                 mul_71                   2 1 515 517 518 0=2
InnerProduct             linear_148               1 1 518 519 0=144 1=1 2=82944
BinaryOp                 add_72                   2 1 511 519 520 0=0
Split                    splitncnn_74             1 2 520 521 522
Slice                    tensor_split_25          1 2 521 523 524 -23300=2,2,-233 1=0
Split                    splitncnn_76             1 3 524 525 526 527
Split                    splitncnn_75             1 2 523 528 529
Concat                   cat_33                   2 1 528 525 530 0=0
Concat                   cat_34                   3 1 26 529 526 531 0=0
InnerProduct             linear_150               1 1 531 532 0=288 1=1 2=41472
Slice                    chunk_4                  1 2 532 533 534 -23300=2,-233,-233 1=1
InnerProduct             linear_149               1 1 530 535 0=144 1=1 2=20736
Slice                    tensor_split_26          1 2 533 536 537 -23300=2,34,-233 1=0
Concat                   cat_35                   3 1 536 in18 537 538 0=0
Split                    splitncnn_77             1 2 538 539 540
Slice                    tensor_split_27          1 2 534 541 542 -23300=2,34,-233 1=0
Concat                   cat_36                   3 1 541 in19 542 543 0=0
Split                    splitncnn_78             1 2 543 544 545
Reshape                  view_358                 1 1 535 546 0=36 1=4 2=10
Permute                  permute_493              1 1 546 547 0=2
BinaryOp                 mul_73                   1 1 547 548 0=2 1=1 2=1.666667e-01
Reshape                  view_359                 1 1 540 549 0=36 1=4 2=50
Reshape                  view_360                 1 1 545 550 0=36 1=4 2=50
Permute                  permute_494              1 1 549 551 0=2
MatMul                   matmultransb_4           2 1 548 551 552 0=1
Softmax                  softmax_71               1 1 552 553 0=-1 1=1
Permute                  permute_496              1 1 550 554 0=2
MatMul                   bmm_403                  2 1 553 554 555
Permute                  permute_497              1 1 555 556 0=2
Reshape                  reshape_236              1 1 556 557 0=144 1=-1
ExpandDims               unsqueeze_595            1 1 557 558
InnerProduct             linear_151               1 1 558 559 0=144 1=1 2=20736
BinaryOp                 add_74                   2 1 522 559 560 0=0
Split                    splitncnn_79             1 2 560 561 562
Slice                    tensor_split_28          1 2 561 563 564 -23300=2,2,-233 1=0
Concat                   cat_37                   2 1 564 563 565 0=0
Permute                  permute_498              1 1 565 566 0=1
Convolution1D            conv1d_91                1 1 566 567 0=288 1=1 2=1 3=1 4=0 5=1 6=41472
GLU                      glu_4                    1 1 567 568 0=0
Concat                   cat_38                   2 1 in20 568 569 0=1
Split                    splitncnn_80             1 2 569 570 571
ConvolutionDepthWise1D   convdw1d_611             1 1 571 572 0=144 1=31 2=1 3=1 4=0 5=1 6=4464 7=144
Split                    splitncnn_81             1 2 572 573 574
BinaryOp                 sub_75                   1 1 573 575 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_32               1 1 575 576
BinaryOp                 mul_76                   2 1 574 576 577 0=2
Convolution1D            conv1d_92                1 1 577 578 0=144 1=1 2=1 3=1 4=0 5=1 6=20736
Slice                    tensor_split_29          1 2 578 579 580 -23300=2,8,-233 1=1
Permute                  permute_500              1 1 579 581 0=1
Permute                  permute_499              1 1 580 582 0=1
Concat                   cat_39                   2 1 582 581 583 0=0
BinaryOp                 add_77                   2 1 562 583 584 0=0
Split                    splitncnn_82             1 2 584 585 586
InnerProduct             linear_152               1 1 586 587 0=576 1=1 2=82944
Split                    splitncnn_83             1 2 587 588 589
BinaryOp                 sub_78                   1 1 588 590 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_33               1 1 590 591
BinaryOp                 mul_79                   2 1 589 591 592 0=2
InnerProduct             linear_153               1 1 592 593 0=144 1=1 2=82944
BinaryOp                 add_80                   2 1 585 593 594 0=0
Split                    splitncnn_84             1 3 594 595 596 597
BinaryOp                 mul_81                   2 1 595 596 598 0=2
Reduction                mean_436                 1 1 598 599 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_82                   1 1 599 600 0=0 1=1 2=1.284874e+00
BinaryOp                 pow_83                   1 1 600 601 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_84                   2 1 597 601 602 0=2
Slice                    tensor_split_30          1 2 602 603 604 -23300=2,2,-233 1=0
Concat                   cat_40                   2 1 603 604 605 0=0
Split                    splitncnn_85             1 2 605 606 607
InnerProduct             linear_154               1 1 607 608 0=576 1=1 2=82944
Split                    splitncnn_86             1 2 608 609 610
BinaryOp                 sub_85                   1 1 609 611 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_34               1 1 611 612
BinaryOp                 mul_86                   2 1 610 612 613 0=2
InnerProduct             linear_155               1 1 613 614 0=144 1=1 2=82944
BinaryOp                 add_87                   2 1 606 614 615 0=0
Split                    splitncnn_87             1 2 615 616 617
Slice                    tensor_split_31          1 2 616 618 619 -23300=2,2,-233 1=0
Split                    splitncnn_89             1 3 619 620 621 622
Split                    splitncnn_88             1 2 618 623 624
Concat                   cat_41                   2 1 623 620 625 0=0
Concat                   cat_42                   3 1 32 624 621 626 0=0
InnerProduct             linear_157               1 1 626 627 0=288 1=1 2=41472
Slice                    chunk_5                  1 2 627 628 629 -23300=2,-233,-233 1=1
InnerProduct             linear_156               1 1 625 630 0=144 1=1 2=20736
Slice                    tensor_split_32          1 2 628 631 632 -23300=2,34,-233 1=0
Concat                   cat_43                   3 1 631 in22 632 633 0=0
Split                    splitncnn_90             1 2 633 634 635
Slice                    tensor_split_33          1 2 629 636 637 -23300=2,34,-233 1=0
Concat                   cat_44                   3 1 636 in23 637 638 0=0
Split                    splitncnn_91             1 2 638 639 640
Reshape                  view_361                 1 1 630 641 0=36 1=4 2=10
Permute                  permute_501              1 1 641 642 0=2
BinaryOp                 mul_88                   1 1 642 643 0=2 1=1 2=1.666667e-01
Reshape                  view_362                 1 1 635 644 0=36 1=4 2=50
Reshape                  view_363                 1 1 640 645 0=36 1=4 2=50
Permute                  permute_502              1 1 644 646 0=2
MatMul                   matmultransb_5           2 1 643 646 647 0=1
Softmax                  softmax_72               1 1 647 648 0=-1 1=1
Permute                  permute_504              1 1 645 649 0=2
MatMul                   bmm_405                  2 1 648 649 650
Permute                  permute_505              1 1 650 651 0=2
Reshape                  reshape_237              1 1 651 652 0=144 1=-1
ExpandDims               unsqueeze_596            1 1 652 653
InnerProduct             linear_158               1 1 653 654 0=144 1=1 2=20736
BinaryOp                 add_89                   2 1 617 654 655 0=0
Split                    splitncnn_92             1 2 655 656 657
Slice                    tensor_split_34          1 2 656 658 659 -23300=2,2,-233 1=0
Concat                   cat_45                   2 1 659 658 660 0=0
Permute                  permute_506              1 1 660 661 0=1
Convolution1D            conv1d_93                1 1 661 662 0=288 1=1 2=1 3=1 4=0 5=1 6=41472
GLU                      glu_5                    1 1 662 663 0=0
Concat                   cat_46                   2 1 in24 663 664 0=1
Split                    splitncnn_93             1 2 664 665 666
ConvolutionDepthWise1D   convdw1d_612             1 1 666 667 0=144 1=31 2=1 3=1 4=0 5=1 6=4464 7=144
Split                    splitncnn_94             1 2 667 668 669
BinaryOp                 sub_90                   1 1 668 670 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_35               1 1 670 671
BinaryOp                 mul_91                   2 1 669 671 672 0=2
Convolution1D            conv1d_94                1 1 672 673 0=144 1=1 2=1 3=1 4=0 5=1 6=20736
Slice                    tensor_split_35          1 2 673 674 675 -23300=2,8,-233 1=1
Permute                  permute_508              1 1 674 676 0=1
Permute                  permute_507              1 1 675 677 0=1
Concat                   cat_47                   2 1 677 676 678 0=0
BinaryOp                 add_92                   2 1 657 678 679 0=0
Split                    splitncnn_95             1 2 679 680 681
InnerProduct             linear_159               1 1 681 682 0=576 1=1 2=82944
Split                    splitncnn_96             1 2 682 683 684
BinaryOp                 sub_93                   1 1 683 685 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_36               1 1 685 686
BinaryOp                 mul_94                   2 1 684 686 687 0=2
InnerProduct             linear_160               1 1 687 688 0=144 1=1 2=82944
BinaryOp                 add_95                   2 1 680 688 689 0=0
Split                    splitncnn_97             1 3 689 690 691 692
BinaryOp                 mul_96                   2 1 690 691 693 0=2
Reduction                mean_438                 1 1 693 694 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_97                   1 1 694 695 0=0 1=1 2=1.493289e+00
BinaryOp                 pow_98                   1 1 695 696 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_99                   2 1 692 696 697 0=2
Slice                    tensor_split_36          1 2 697 698 699 -23300=2,2,-233 1=0
Concat                   cat_48                   2 1 698 699 700 0=0
Split                    splitncnn_98             1 2 700 701 702
InnerProduct             linear_161               1 1 702 703 0=576 1=1 2=82944
Split                    splitncnn_99             1 2 703 704 705
BinaryOp                 sub_100                  1 1 704 706 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_37               1 1 706 707
BinaryOp                 mul_101                  2 1 705 707 708 0=2
InnerProduct             linear_162               1 1 708 709 0=144 1=1 2=82944
BinaryOp                 add_102                  2 1 701 709 710 0=0
Split                    splitncnn_100            1 2 710 711 712
Slice                    tensor_split_37          1 2 711 713 714 -23300=2,2,-233 1=0
Split                    splitncnn_102            1 3 714 715 716 717
Split                    splitncnn_101            1 2 713 718 719
Concat                   cat_49                   2 1 718 715 720 0=0
Concat                   cat_50                   3 1 38 719 716 721 0=0
InnerProduct             linear_164               1 1 721 722 0=288 1=1 2=41472
Slice                    chunk_6                  1 2 722 723 724 -23300=2,-233,-233 1=1
InnerProduct             linear_163               1 1 720 725 0=144 1=1 2=20736
Slice                    tensor_split_38          1 2 723 726 727 -23300=2,34,-233 1=0
Concat                   cat_51                   3 1 726 in26 727 728 0=0
Split                    splitncnn_103            1 2 728 729 730
Slice                    tensor_split_39          1 2 724 731 732 -23300=2,34,-233 1=0
Concat                   cat_52                   3 1 731 in27 732 733 0=0
Split                    splitncnn_104            1 2 733 734 735
Reshape                  view_364                 1 1 725 736 0=36 1=4 2=10
Permute                  permute_509              1 1 736 737 0=2
BinaryOp                 mul_103                  1 1 737 738 0=2 1=1 2=1.666667e-01
Reshape                  view_365                 1 1 730 739 0=36 1=4 2=50
Reshape                  view_366                 1 1 735 740 0=36 1=4 2=50
Permute                  permute_510              1 1 739 741 0=2
MatMul                   matmultransb_6           2 1 738 741 742 0=1
Softmax                  softmax_73               1 1 742 743 0=-1 1=1
Permute                  permute_512              1 1 740 744 0=2
MatMul                   bmm_407                  2 1 743 744 745
Permute                  permute_513              1 1 745 746 0=2
Reshape                  reshape_238              1 1 746 747 0=144 1=-1
ExpandDims               unsqueeze_597            1 1 747 748
InnerProduct             linear_165               1 1 748 749 0=144 1=1 2=20736
BinaryOp                 add_104                  2 1 712 749 750 0=0
Split                    splitncnn_105            1 2 750 751 752
Slice                    tensor_split_40          1 2 751 753 754 -23300=2,2,-233 1=0
Concat                   cat_53                   2 1 754 753 755 0=0
Permute                  permute_514              1 1 755 756 0=1
Convolution1D            conv1d_95                1 1 756 757 0=288 1=1 2=1 3=1 4=0 5=1 6=41472
GLU                      glu_6                    1 1 757 758 0=0
Concat                   cat_54                   2 1 in28 758 759 0=1
Split                    splitncnn_106            1 2 759 760 761
ConvolutionDepthWise1D   convdw1d_613             1 1 761 762 0=144 1=31 2=1 3=1 4=0 5=1 6=4464 7=144
Split                    splitncnn_107            1 2 762 763 764
BinaryOp                 sub_105                  1 1 763 765 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_38               1 1 765 766
BinaryOp                 mul_106                  2 1 764 766 767 0=2
Convolution1D            conv1d_96                1 1 767 768 0=144 1=1 2=1 3=1 4=0 5=1 6=20736
Slice                    tensor_split_41          1 2 768 769 770 -23300=2,8,-233 1=1
Permute                  permute_516              1 1 769 771 0=1
Permute                  permute_515              1 1 770 772 0=1
Concat                   cat_55                   2 1 772 771 773 0=0
BinaryOp                 add_107                  2 1 752 773 774 0=0
Split                    splitncnn_108            1 2 774 775 776
InnerProduct             linear_166               1 1 776 777 0=576 1=1 2=82944
Split                    splitncnn_109            1 2 777 778 779
BinaryOp                 sub_108                  1 1 778 780 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_39               1 1 780 781
BinaryOp                 mul_109                  2 1 779 781 782 0=2
InnerProduct             linear_167               1 1 782 783 0=144 1=1 2=82944
BinaryOp                 add_110                  2 1 775 783 784 0=0
Split                    splitncnn_110            1 3 784 785 786 787
BinaryOp                 mul_111                  2 1 785 786 788 0=2
Reduction                mean_440                 1 1 788 789 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_112                  1 1 789 790 0=0 1=1 2=1.652225e+00
BinaryOp                 pow_113                  1 1 790 791 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_114                  2 1 787 791 792 0=2
Slice                    tensor_split_42          1 2 792 793 794 -23300=2,2,-233 1=0
Concat                   cat_56                   2 1 793 794 795 0=0
Split                    splitncnn_111            1 2 795 796 797
InnerProduct             linear_168               1 1 797 798 0=576 1=1 2=82944
Split                    splitncnn_112            1 2 798 799 800
BinaryOp                 sub_115                  1 1 799 801 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_40               1 1 801 802
BinaryOp                 mul_116                  2 1 800 802 803 0=2
InnerProduct             linear_169               1 1 803 804 0=144 1=1 2=82944
BinaryOp                 add_117                  2 1 796 804 805 0=0
Split                    splitncnn_113            1 2 805 806 807
Slice                    tensor_split_43          1 2 806 808 809 -23300=2,2,-233 1=0
Split                    splitncnn_115            1 3 809 810 811 812
Split                    splitncnn_114            1 2 808 813 814
Concat                   cat_57                   2 1 813 810 815 0=0
Concat                   cat_58                   3 1 44 814 811 816 0=0
InnerProduct             linear_171               1 1 816 817 0=288 1=1 2=41472
Slice                    chunk_7                  1 2 817 818 819 -23300=2,-233,-233 1=1
InnerProduct             linear_170               1 1 815 820 0=144 1=1 2=20736
Slice                    tensor_split_44          1 2 818 821 822 -23300=2,34,-233 1=0
Concat                   cat_59                   3 1 821 in30 822 823 0=0
Split                    splitncnn_116            1 2 823 824 825
Slice                    tensor_split_45          1 2 819 826 827 -23300=2,34,-233 1=0
Concat                   cat_60                   3 1 826 in31 827 828 0=0
Split                    splitncnn_117            1 2 828 829 830
Reshape                  view_367                 1 1 820 831 0=36 1=4 2=10
Permute                  permute_517              1 1 831 832 0=2
BinaryOp                 mul_118                  1 1 832 833 0=2 1=1 2=1.666667e-01
Reshape                  view_368                 1 1 825 834 0=36 1=4 2=50
Reshape                  view_369                 1 1 830 835 0=36 1=4 2=50
Permute                  permute_518              1 1 834 836 0=2
MatMul                   matmultransb_7           2 1 833 836 837 0=1
Softmax                  softmax_74               1 1 837 838 0=-1 1=1
Permute                  permute_520              1 1 835 839 0=2
MatMul                   bmm_409                  2 1 838 839 840
Permute                  permute_521              1 1 840 841 0=2
Reshape                  reshape_239              1 1 841 842 0=144 1=-1
ExpandDims               unsqueeze_598            1 1 842 843
InnerProduct             linear_172               1 1 843 844 0=144 1=1 2=20736
BinaryOp                 add_119                  2 1 807 844 845 0=0
Split                    splitncnn_118            1 2 845 846 847
Slice                    tensor_split_46          1 2 846 848 849 -23300=2,2,-233 1=0
Concat                   cat_61                   2 1 849 848 850 0=0
Permute                  permute_522              1 1 850 851 0=1
Convolution1D            conv1d_97                1 1 851 852 0=288 1=1 2=1 3=1 4=0 5=1 6=41472
GLU                      glu_7                    1 1 852 853 0=0
Concat                   cat_62                   2 1 in32 853 854 0=1
Split                    splitncnn_119            1 2 854 855 856
ConvolutionDepthWise1D   convdw1d_614             1 1 856 857 0=144 1=31 2=1 3=1 4=0 5=1 6=4464 7=144
Split                    splitncnn_120            1 2 857 858 859
BinaryOp                 sub_120                  1 1 858 860 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_41               1 1 860 861
BinaryOp                 mul_121                  2 1 859 861 862 0=2
Convolution1D            conv1d_98                1 1 862 863 0=144 1=1 2=1 3=1 4=0 5=1 6=20736
Slice                    tensor_split_47          1 2 863 864 865 -23300=2,8,-233 1=1
Permute                  permute_524              1 1 864 866 0=1
Permute                  permute_523              1 1 865 867 0=1
Concat                   cat_63                   2 1 867 866 868 0=0
BinaryOp                 add_122                  2 1 847 868 869 0=0
Split                    splitncnn_121            1 2 869 870 871
InnerProduct             linear_173               1 1 871 872 0=576 1=1 2=82944
Split                    splitncnn_122            1 2 872 873 874
BinaryOp                 sub_123                  1 1 873 875 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_42               1 1 875 876
BinaryOp                 mul_124                  2 1 874 876 877 0=2
InnerProduct             linear_174               1 1 877 878 0=144 1=1 2=82944
BinaryOp                 add_125                  2 1 870 878 879 0=0
Split                    splitncnn_123            1 3 879 880 881 882
